_notes/_posts/programming/2024-01-17-cppcoreguidelines-nl2.org
#+layout: post
#+title: CppCoreGuidelines NL.2 在注释中表明意图
#+categories: technology
#+tags: CppCoreGuidelines

[[http://kimi.im/tags.html#CppCoreGuidelines-ref][C++ 核心指南目录]]

"State intent in comments"

理由

代码说明做了什么，而不是打算要做什么。通常代码意图能比代码实现说明地更清晰准确。


例子

#+header: :namespaces std :includes  <iostream> <vector> <algorithm>
#+begin_src C++ :exports both :flags -std=c++20  :eval no-export :results output
void stable_sort(Sortable& c)
    // sort c in the order determined by <, keep equal elements (as
    // defined by ==) in their original relative order
{
    // ... quite a few lines of non-trivial code ...
}
#+end_src


注意

如果代码和注释冲突，那么两者可能都出错了。
