_posts/programming/2024-01-17-cppcoreguidelines-nl2.html
---
layout: post
title: CppCoreGuidelines NL.2 在注释中表明意图
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;State intent in comments&rdquo;
</p>

<p>
理由
</p>

<p>
代码说明做了什么，而不是打算要做什么。通常代码意图能比代码实现说明地更清晰准确。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">stable_sort</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Sortable</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">c</span><span style="color: #707183;">)</span>
    <span style="color: #3F7F5F;">// sort c in the order determined by &lt;, keep equal elements (as</span>
    <span style="color: #3F7F5F;">// defined by ==) in their original relative order</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ... quite a few lines of non-trivial code ...</span>
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
注意
</p>

<p>
如果代码和注释冲突，那么两者可能都出错了。
</p>
